{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача 1\n",
    "\n",
    "Напишите программу, которая получает целое число и возвращает его шестнадцатеричное строковое представление. \n",
    "\n",
    "Функцию hex используйте для проверки своего результата."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Двоичное представление: 1001001011\n",
      "Восьмеричное представление: 1113\n",
      "Строковое представление: 587\n",
      "Шестнадцатеричное представление: 24B\n",
      "Проверка:\n",
      "Двоичное представление (bin): 1001001011\n",
      "Восьмеричное представление (oct): 1113\n",
      "Шестнадцатеричное представление (hex): 24B\n"
     ]
    }
   ],
   "source": [
    "def int_to_base(n: int, base: int) -> str:\n",
    "    \"\"\"\n",
    "    Преобразует целое число в строковое представление в заданной системе счисления.\n",
    "    :param n: Число, которое нужно преобразовать.\n",
    "    :param base: Основание системы счисления (например, 2 для двоичной, 8 для восьмеричной, 16 для шестнадцатеричной).\n",
    "    :return: Строковое представление числа в заданной системе счисления.\n",
    "    \"\"\"\n",
    "    if n == 0:\n",
    "        return \"0\"  # Если число равно нулю, возвращаем строку \"0\"\n",
    "\n",
    "    digits = \"0123456789ABCDEF\"  # Строка, содержащая все возможные цифры для систем счисления до 16\n",
    "    res = \"\"  # Пустая строка для результата\n",
    "    while n > 0:  # Пока число больше нуля\n",
    "        res = digits[n % base] + res  # Добавляем соответствующую цифру в начало результата\n",
    "        n //= base  # Делим число на основание системы счисления\n",
    "\n",
    "    return res  # Возвращаем полученный результат\n",
    "\n",
    "\n",
    "def convert_number(num: int) -> tuple[str, str, str, str]:\n",
    "    \"\"\"\n",
    "    Преобразует число num в двоичное, восьмеричное, строковое и шестнадцатеричное представление.\n",
    "    :param num: Целое число, которое нужно преобразовать.\n",
    "    :return: Кортеж с четырьмя строками: двоичным, восьмеричным, строковым и шестнадцатеричным представлением числа.\n",
    "    \"\"\"\n",
    "    binary = int_to_base(num, 2)  # Преобразуем число в двоичное представление\n",
    "    octal = int_to_base(num, 8)  # Преобразуем число в восьмеричное представление\n",
    "    string = str(num)  # Преобразуем число в строку\n",
    "    hexadecimal = int_to_base(num, 16)  # Преобразуем число в шестнадцатеричное представление\n",
    "    return binary, octal, string, hexadecimal  # Возвращаем все четыре представления числа\n",
    "\n",
    "\n",
    "num = int(input(\"Введите целое число: \"))  # Запрашиваем у пользователя ввод целого числа\n",
    "binary, octal, string, hexadecimal = convert_number(num)  # Преобразуем число в разные представления\n",
    "print(\"Двоичное представление:\", binary)  # Выводим двоичное представление числа\n",
    "print(\"Восьмеричное представление:\", octal)  # Выводим восьмеричное представление числа\n",
    "print(\"Строковое представление:\", string)  # Выводим строковое представление числа\n",
    "print(\"Шестнадцатеричное представление:\", hexadecimal)  # Выводим шестнадцатеричное представление числа\n",
    "\n",
    "# Проверка результата с использованием встроенных функций bin, oct и hex\n",
    "print(\"Проверка:\")\n",
    "print(\"Двоичное представление (bin):\", bin(num)[2:])  # Проверяем двоичное представление с использованием встроенной функции bin\n",
    "print(\"Восьмеричное представление (oct):\", oct(num)[2:])  # Проверяем восьмеричное представление с использованием встроенной функции oct\n",
    "print(\"Шестнадцатеричное представление (hex):\", hex(num)[2:].upper())  # Проверяем шестнадцатеричное представление с использованием встроенной функции hex"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Задача 2\n",
    "\n",
    "Напишите программу, которая принимает две строки вида “a/b” - дробь с числителем и знаменателем.\n",
    "\n",
    "Программа должна возвращать сумму и произведение* дробей. Для проверки своего кода используйте модуль fractions"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Сумма дробей: 1\n",
      "Произведение дробей: 1/4\n"
     ]
    }
   ],
   "source": [
    "from fractions import Fraction\n",
    "\n",
    "\n",
    "def calculate_fractions(frac1: str, frac2: str) -> tuple[Fraction, Fraction]:\n",
    "    \"\"\"\n",
    "    Вычисляет сумму и произведение двух дробей, представленных в виде строк.\n",
    "\n",
    "    Параметры:\n",
    "    frac1 (str): Строка, представляющая первую дробь в формате 'a/b'.\n",
    "    frac2 (str): Строка, представляющая вторую дробь в формате 'a/b'.\n",
    "\n",
    "    Возвращает:\n",
    "    tuple[Fraction, Fraction]: Кортеж из двух объектов Fraction, где первый элемент — это сумма дробей,\n",
    "                               а второй элемент — произведение дробей.\n",
    "    \"\"\"\n",
    "    # Преобразование строк в объекты Fraction\n",
    "    fraction1 = Fraction(frac1)\n",
    "    fraction2 = Fraction(frac2)\n",
    "\n",
    "    # Сложение дробей\n",
    "    sum_of_fractions = fraction1 + fraction2\n",
    "    # Умножение дробей\n",
    "    product_of_fractions = fraction1 * fraction2\n",
    "\n",
    "    return sum_of_fractions, product_of_fractions\n",
    "\n",
    "\n",
    "# Запрос ввода двух дробей от пользователя\n",
    "frac1 = input(\"Введите первую дробь в формате 'a/b': \")\n",
    "frac2 = input(\"Введите вторую дробь в формате 'a/b': \")\n",
    "\n",
    "# Вычисление суммы и произведения дробей\n",
    "sum_fraction, product_fraction = calculate_fractions(frac1, frac2)\n",
    "print(f\"Сумма дробей: {sum_fraction}\")\n",
    "print(f\"Произведение дробей: {product_fraction}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.5"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
